Repository: pozsarzs/modshell
Catalog: message/*-cp852/modshell.po
Languages: hu

source: 1st
hu: Elsã

source: 2nd
hu: M†sodik

source: 3rd
hu: Harmadik

source: 4th
hu: Negyedik

source: 5th
hu: ôtîdik

source: 6th
hu: Hatodik

source: 7th
hu: Hetedik

source: Command-driven scriptable Modbus utility
hu: ParancsvezÇrelt szkriptelhetã Modbus segÇdprogram

source: Use 'help COMMAND' to show usage.
hu: Haszn†lja a 'help PARANCS'-ot a haszn†lata megjelen°tÇsÇhez.

source: Usage this command:
hu: A parancs haszn†lata:

source: parameter:
hu: paramÇter:

source: is not set.
hu: nincs be†ll°tva.

source: device:
hu: eszkîz:

source: baudrate:
hu: sebessÇg:

source: bits:
hu: bitek:

source: protocol:
hu: protokoll:

source: IP address:
hu: IP-c°m:

source: device ID:
hu: eszkîz ID:

source: File exist, overwrite? (y/n)
hu: LÇtezik a f†jl, felÅl°rjam? (y/n)

source: Command line history has exported to
hu: A parancssori elãzmÇnyek export†ltak ebbe:

source: Settings has saved to
hu: A be†ll°t†sok el lettek mentve ebbe:

source: Settings has loaded from
hu: A be†ll°t†sok be lettek tîltve ebbãl:

source: Register content has exported to
hu: A regisztertartalom export†lva ebbe:

source: Register content has imported from
hu: A regisztertartalom import†lt ebbãl:

source: Register content has saved to
hu: A regisztertartalom elmentve ebbe:

source: Register content has loaded from
hu: A regisztertartalom betîltve ebbãl:

source: Useable file types:
hu: Haszn†lhat¢ f†jlt°pusok:

source: Press a key to continue...
hu: Nyomjon meg egy billenty˚t a folytat†shoz...

source: Note: - register: local buffer register - remote register: register of the connected device
hu: MegjegyzÇs: - regiszter: helyi puffer regiszter - t†voli regiszter: a csatlakoztatott eszkîz regisztere

source: Select register type:
hu: V†lasszon regisztert°pust:

source: Local register type (dinp/coil/ireg/hreg: 1/2/3/4):
hu: Helyi regiszter t°pus (dinp/coil/ireg/hreg: 1/2/3/4):

source: Start address (0-9990):
hu: Kezdãc°m (0-9990):

source: Echo mode:
hu: Visszhang m¢d:

source: Mini serial console (exit: <F10>)
hu: Mini soros konzol (kilÇpÇs: <F10>)

source: Device number (0-7):
hu: Eszkîzsz†m (0-7):

source: Press <Esc> to break receiving.
hu: Nyomd meg az <Esc>-et a vÇtel megszak°t†s†hoz.

source: Variable monitor mode:
hu: V†ltoz¢ monitor m¢d:

source: This command can only be used in a script!
hu: Ez a parancs csak szkriptben haszn†lhat¢!

source: line
hu: sor

source: hour
hu: ¢ra

source: minute
hu: perc

source: status
hu: †llapot

source: No script loaded.
hu: Nincs betîltîtt szkript.

source: Scroll: [Home][PgUp][Up]-[Down][PgDn][End]
hu: GîrgetÇs: [Home][PgUp][Up]-[Down][PgDn][End]

source: Move: [Ctrl-Home][Ctrl-Left][Left]-[Right][Ctrl-Right][Ctrl-End]
hu: Mozg†s: [Ctrl-Home][Ctrl-Left][Left]-[Right][Ctrl-Right][Ctrl-End]

source: Edit: [Ins][Del][Esc]
hu: SzerkesztÇs: [Ins][Del][Esc]

source: all file|*
hu: minden f†jl|*

source: batch file|*.bat|all file|*.*
hu: batch f†jl|*.bat|minden f†jl|*.*

source: &Cancel
hu: &MÇgsem

source: &Set
hu: &Be†ll°t

source: &Reset
hu: &Tîrîl

source: foreground
hu: elãtÇrsz°n

source: background
hu: h†ttÇrsz°n

source: type
hu: t°pus

source: device
hu: eszkîz

source: port/baudrate
hu: port/sebessÇg

source: databits
hu: adatbitek

source: parity
hu: parit†s

source: stopbit(s)
hu: stopbit(ek)

source: protocol
hu: protokoll

source: ID/(IP) address
hu: ID/(IP) c°m

source: CSV file|*.csv|INI file|*.ini|XML file|*.xml
hu: CSV f†jl|*.csv|INI f†jl|*.ini|XML f†jl|*.xml

source: INI file|*.ini|XML file|*.xml
hu: INI f†jl|*.ini|XML f†jl|*.xml

source: registers
hu: regiszterek

source: start address
hu: kezdãc°m

source: count
hu: mennyisÇg

source: &Export
hu: &Export†l

source: &Dump
hu: &Ki°rat

source: Use 'Project/Set console colors' on GUI version.
hu: Haszn†lja a Projekt/Konzol sz°nek be†ll°t†sa'-t a GUI v†ltozatn†l.

source: Use 'Script/Edit script' on GUI version.
hu: Haszn†lja a Szkript/Szkript szerkesztÇs'-t a GUI v†ltozatn†l.

source: from
hu: ebbãl

source: to
hu: ebbe

source: number
hu: sz†m

source: &Convert
hu: µt&alak°t

source: &Start
hu: In&d°t†s

source: New project name:
hu: Èj projekt nÇv:

source: name
hu: nÇv

source: connection
hu: kapcsolat

source: variable
hu: v†ltoz¢

source: message
hu: Åzenet

source: &Write
hu: ÷&r†s

source: &Read
hu: Ol&vas†s

source: Go on!
hu: Tov†bb!

source: Variable
hu: V†ltoz¢

source: Value
hu: êrtÇk

source: Use 'Utilities/Mini serial console' on GUI version.
hu: Haszn†lja az 'Eszkîzîk/Mini soros konzol'-t a GUI v†ltozatn†l.

source: timeout
hu: idãt£llÇpÇs

source: or a variable
hu: vagy v†ltoz¢

source: or "text"
hu: vagy "szîveg"

source: Cannot use it on this operation system!
hu: Ezen az oper†ci¢s rendszeren ez nem haszn†lhat¢!

source: device address:
hu: eszkîz c°m:

source: Cannot use it in GUI version!
hu: Ez a grafikus felÅlet˚ v†ltozatban nem haszn†lhat¢!

source: Build date:
hu: Ford°t†s ideje:

source: Builder:
hu: Ford°t¢:

source: FPC version:
hu: FPC verzi¢:

source: Target OS:
hu: CÇl OS:

source: Target CPU:
hu: CÇl CPU:

source: Sorry, this feature is not yet implemented.
hu: Sajn†lom, hogy ez a szolg†ltat†s mÇg nem val¢sult meg.

source: No such command!
hu: Nincs ilyen parancs!

source: Device number must be 0-7!
hu: Az eszkîz sz†m†nak 0-7-nek kell lennie!

source: Protocol number must be 0-7!
hu: A protokoll sz†m†nak 0-7-nek kell lennie!

source: Connection number must be 0-7!
hu: A kapcsolat sz†m†nak 0-7-nek kell lennie!

source: IP address is not valid!
hu: Az IP-c°m nem ÇrvÇnyes!

source: Parameter(s) required!
hu: ParamÇterek szÅksÇges(ek)!

source: Device ID must be 1-247!
hu: Az eszkîz ID-nek 1-247-nek kell lennie!

source: Cannot export command line history to
hu: Nem lehet export†lni a parancssori elãzmÇnyeket ebbe:

source: Cannot save settings to
hu: Nem lehet menteni a be†ll°t†sokat ebbe:

source: Cannot load settings from
hu: Nem lehet betîlteni a be†ll°t†sokat ebbãl:

source: Cannot export register content to
hu: Nem lehet export†lni a regisztertartalmat ebbe:

source: Cannot import register content from
hu: Nem lehet import†lni a regisztertartalmat ebbãl:

source: Cannot save register content to
hu: Nem mentheti a regisztertartalmat ebbe:

source: Cannot load register content from
hu: Nem lehet betîlteni a regisztertartalmat ebbãl:

source: Illegal character in the project name!
hu: Nem engedÇlyezett karakter a projekt nevÇben!

source: Illegal character in the variable name!
hu: Nem engedÇlyezett karakter a v†ltoz¢ nevÇben!

source: Cannot define more variable!
hu: Nem lehet lÇtrehozni a v†ltoz¢t!

source: There is already a variable or a constant with that name.
hu: Van m†r egy v†ltoz¢ vagy †lland¢ ezzel a nÇvvel.

source: Cannot initialize serial port:
hu: Nem lehet inicializ†lni a soros portot!

source: No such variable:
hu: Nincs ilyen v†ltoz¢:

source: Calculating error!
hu: Sz†m°t†si hiba!

source: No such script file:
hu: Nincs ilyen szkriptf†jl:

source: Cannot load script from
hu: Nem lehet betîlteni a szkriptet ebbãl:

source: Script buffer is full!
hu: A szkript puffer megtelt!

source: Specified device is not a serial port!
hu: A megadott eszkîz nem soros port!

source: Specified device is not a ethernet port!
hu: A megadott eszkîz nem ethernet port!

source: Cannot read data from serial port!
hu: Nem lehet olvasni a soros portr¢l!

source: Cannot write data to serial port!
hu: Nem lehet °rni a soros portot!

source: Modbus telegram parsing error!
hu: Modbus telegram ÇrtelmezÇsi hiba!

source: Modbus error: illegal function.
hu: Modbus hiba: szab†lytalan funkci¢.

source: Modbus error: illegal data address.
hu: Modbus hiba: szab†lytalan adatc°m.

source: Modbus error: illegal data value.
hu: Modbus hiba: szab†lytalan adatÇrtÇk.

source: Modbus error: slave device failure.
hu: Modbus hiba: slave eszkîz hiba.

source: Illegal character in the constant name!
hu: Nem engedÇlyezett karakter az †lland¢ nevÇben!

source: Cannot define more constant!
hu: Nem lehet lÇtrehozni tîbb †lland¢t!

source: No such label:
hu: Nincs ilyen c°mke:

source: Cannot write log record to
hu: Nem lehet °rni a napl¢f†jlt:

source: Cannot save script to
hu: Nem lehet menteni a szkriptet ebbe:

source: Cannot run default webbrowser!
hu: Nem tudom futtatni az alapÇrtelmezÇs szerinti bîngÇszãt!

source: Cannot list directory!
hu: A kînyvt†rtartalom list†z†sa nem sikerÅlt!

source: Cannot change directory!
hu: Nem sikerÅlt kînyvt†rt v†ltani!

source: Cannot make directory!
hu: A kînyvt†r lÇtrehoz†sa nem sikerÅlt!

source: Cannot remove directory!
hu: A kînyvt†r tîrlÇse nem sikerÅlt!

source: Cannot erase file!
hu: A f†jl tîrlÇse nem sikerÅlt!

source: Cannot type file!
hu: A f†jl ki°r†sa nem sikerÅlt!

source: Cannot copy file!
hu: A f†jl m†sol†sa nem sikerÅlt!

source: Cannot rename file!
hu: A f†jl †tnevezÇse nem sikerÅlt!

source: Cannot set connection timeout!
hu: Nem lehet be†ll°tani az idãt£llÇpÇst!

source: Operation error!
hu: M˚velet hiba!

source: Locked device!
hu: Z†rolt eszkîz!

source: Cannot create console log file!
hu: Nem lehet lÇtrehozni a konzol napl¢f†jlj†t!

source: The value of the constant can only be set once!
hu: Az †lland¢ ÇrtÇke csak egyszer †ll°that¢ be!

source: No such array:
hu: Nincs ilyen tîmb:

source: Cannot define more array!
hu: Nem lehet lÇtrehozni tîbb tîmbît!

source: Address must be 1-255!
hu: Az eszkîz c°mÇnek 1-255-nek kell lennie!

source: The specified parameter is not a variable array:
hu: A megadott eszkîz nem v†ltoz¢ tîmb:

source: This can only be used with the DCON protocol!
hu: Ez csak DCON protokollal haszn†lhat¢!

source: Minimal terminal size is 80x25!
hu: A legkisebb termin†l mÇret 80x25!

source: copy one or more remote reg. between two connections
hu: egy vagy tîbb t†voli regiszter m†sol†sa kÇt kapcsolat kîzîtt

source: F10 exit from program
hu: F10 kilÇpÇs a programb¢l

source: ALT-G show device, protocol, connection or project name
hu: ALT-G eszkîz, protokoll, kapcsolat vagy projektnÇv ki°r†sa

source: F1 show description or usage of the commands
hu: F1 parancs le°r†s vagy haszn†lat megjelen°tÇse

source: ALT-L set value of a variable or a register
hu: ALT-L regisztertartalom be†ll°t†sa

source: ALT-P print message, value of the variable and register
hu: ALT-P Åzenet, a v†ltoz¢ vagy regisztertartalom ki°r†sa

source: ALT-R read one or more remote registers to buffer
hu: ALT-R adat olvas†sa t†voli regiszterbãl a pufferbe

source: ALT-T reset device, protocol, connection or project name
hu: ALT-T eszkîz, protokoll, kapcsolat vagy projektnÇv tîrlÇse

source: ALT-S set device, protocol, connection, default colors, project name or timeout
hu: ALT-S eszkîz, protokoll, kapcsolat, sz°nek, projektnÇv vagy idãt£llÇpÇs be†ll°t†sa

source: show system date and time
hu: d†tum Çs idã megjelen°tÇse

source: show version and build information of this program
hu: v†ltozat Çs ford°t†si inform†ci¢k a programr¢l

source: ALT-W write data from buffer to one or more remote registers
hu: ALT-W adat °r†sa egy vagy tîbb pufferbãl a t†voli regiszterbe

source: F8 clear screen
hu: F8 kÇpernyãtîrlÇs

source: F2 save settings of device, protocol and connection
hu: F2 eszkîz-, protokoll- Çs kapcsolatbe†ll°t†sok mentÇse

source: F3 load settings of device, protocol and connection
hu: F3 eszkîz-, protokoll- Çs kapcsolatbe†ll°t†sok betîltÇse

source: ALT-E export value of the one or more registers
hu: ALT-E egy vagy tîbb regisztertartalom export†l†sa

source: export command line history to make a script easily
hu: parancssori elãzmÇnyek export†l†sa

source: ALT-C convert value between different numeral systems
hu: ALT-C konvert†l†s a kÅlînbîzã sz†mrendszerek kîzîtt

source: F4 save all registers
hu: F4 îsszes regisztertartalom mentÇse

source: F5 load all registers
hu: F5 îsszes regisztertartalom betîltÇse

source: list all variable with value or define a new one
hu: az îsszes v†ltoz¢ ki°r†sa vagy £j lÇtrehoz†sa

source: set temporary foreground and background colors for print command
hu: ideiglenes elãtÇr- Çs a h†ttÇrsz°n be†ll°t†sa a print parancshoz

source: ALT-I import value of the one or more registers
hu: ALT-I egy vagy tîbb regisztertartalom import†l†sa

source: AND logical operations
hu: êS logikai m˚velet

source: OR logical operations
hu: VAGY logikai m˚velet

source: NOT logical operations
hu: NOT logikai m˚velet

source: XOR logical operations
hu: XOR logikai m˚velet

source: bit shift to left
hu: biteltol†s balra

source: bit shift to right
hu: biteltol†s jobbra

source: addition mathematical operation
hu: îsszead†s matematikai m˚velet

source: substraction mathematical operation
hu: kivon†s matematikai m˚velet

source: multiplication mathematical operation
hu: szorz†s matematikai m˚velet

source: division mathematical operation
hu: oszt†s matematikai m˚velet

source: F6 dump all registers in binary/hexadecimal format to a table
hu: F6 t†bl†zatos regiszterki°r†s bin. vagy hexadec. form†ban

source: wait for a keystroke or specified time
hu: v†rakoz†s billenty˚leÅtÇsre vagy idã leteltÇre

source: F7 open a simple serial console
hu: F7 egyszer˚ soros konzol

source: read string from serial device
hu: string olvas†sa soros portr¢l

source: write string to serial device
hu: string °r†sa soros portra

source: F9 query local echo status or enable/disable it
hu: F9 visszahang †llapot lekÇrÇse/be†ll°t†sa

source: SHIFT-F3 load ModShell script from file
hu: SHIFT-F3 ModShell szkript betîltÇse f†jlb¢l

source: F12 run loaded ModShell script
hu: F12 betîltîtt ModShell szkript futatt†sa

source: F11 list loaded ModShell script
hu: F11 betîltîtt ModShell szkript list†z†sa

source: round real number
hu: termÇszetes sz†m kerek°tÇse

source: cosine function
hu: koszinusz fÅggvÇny

source: cotangent function
hu: kotangens fÅggvÇny

source: decrement integer
hu: egÇsz sz†m csîkkentÇse eggyel

source: natural exponential
hu: termÇszetes exponenci†lis fÅggvÇny

source: integer division
hu: egÇsz oszt†s

source: modulus division
hu: modulusz oszt†s

source: increment integer
hu: egÇsz sz†m nîvelÇse eggyel

source: natural logarithm
hu: termÇszetes alap£ logaritmus

source: multiplicative inverse
hu: reciprokÇrtÇk

source: odd or event
hu: p†ros vagy p†ratlan

source: create random integer
hu: vÇletlen egÇsz sz†m kÇpzÇse

source: tangent function
hu: tangens fÅggvÇny

source: sine function
hu: szinusz fÅggvÇny

source: square
hu: nÇgyzetreemelÇs

source: square root
hu: nÇgyzetgyîkvon†s

source: roll bit of integer to left
hu: bitgîrgetÇs balra

source: roll bit of integer to right
hu: bitgîrgetÇs jobbra

source: conversion to uppercase
hu: †talak°t†s nagybet˚ssÇ

source: length of string
hu: karakterl†nc hossza

source: conversion to lowercase
hu: †talak°t†s kisbet˚ssÇ

source: specified element of the string
hu: a karakterl†nc megadott eleme

source: convert byte to char
hu: b†jt karakterrÇ alak°t†sa

source: convert char to byte
hu: karakter b†jtt† alak°t†sa

source: list all constant with value or define a new one
hu: az îsszes †lland¢ ki°r†sa vagy £j lÇtrehoz†sa

source: value of the specified bit
hu: megadott bit ÇrtÇke

source: exponentiation
hu: hatv†nyoz†s

source: jump to specified label (only in script)
hu: ugr†s a megadott c°mkÇre (csak szkripteknÇl)

source: selection statement
hu: el†gaz†s

source: loop iteration
hu: sz†ml†l¢ hurok

source: define label (only in script)
hu: c°mke lÇtrehoz†sa (csak szkripteknÇl)

source: start internal Modbus slave/server
hu: start belsã Modbus szolga/szerver

source: start internal Modbus gateway
hu: start belsã Modbus †tj†r¢

source: check the value is in the range
hu: ÇrtÇktartom†nyba tartoz†s ellenãrzÇse

source: make LRC
hu: LRC kÇpzÇse

source: make CRC
hu: CRC kÇpzÇse

source: exponentiation of two
hu: a kettã hatv†nyai

source: show ASCII table
hu: ASCII t†bla mutat†s

source: make a beep sound with internal speaker
hu: hangjelzÇs a belsã hangsz¢r¢val

source: calculate average
hu: †tlagsz†m°t†s

source: propotional value calculation (with zero and span)
hu: ar†nyos ÇrtÇk sz†m°t†s (kezdeti Çs vÇgÇrtÇkkel)

source: concatenate strings
hu: karakterl†ncok îsszef˚zÇse

source: delete specified element(s) of the string
hu: a karakterl†nc megadott elemÇnek tîrlÇse

source: find specified element(s) in the string
hu: keresÇs a karakterl†ncban

source: insert element(s) into string
hu: besz£r†s a karakterl†ncba

source: replace element(s) in the string
hu: a karakterl†nc megadott elemÇnek cserÇje

source: ALT-M monitoring the value of variables
hu: ALT-M v†ltoz¢ÇrtÇkek megfigyelÇse

source: append a record to log file
hu: egy bejegyzÇs hozz†f˚zÇse a napl¢f†jlhoz

source: loaded script scheduled execution
hu: a betîltîtt szkript Åtemezett futatt†sa

source: SHIFT-F4 edit loaded script with line editor
hu: SHIFT-F4 a betîltîtt szkript szerkesztÇse sorszerkesztãvel

source: SHIFT-F8 erase script from buffer
hu: SHIFT-F8 a szkript tîrlÇse a pufferb¢l

source: SHIFT-F2 save loaded script to disc
hu: SHIFT-F2 a betîltîtt szkript mentÇse lemezre

source: list directory content
hu: kînyvt†rtartalom list†z†sa

source: change directory or get name
hu: kînyvt†r v†lt†sa vagy kînyvt†rnÇv ki°r†sa

source: make directory
hu: kînyvt†r lÇtrehoz†sa

source: remove directory
hu: kînyvt†r tîrlÇse

source: remove file
hu: f†jl tîrlÇse

source: type file
hu: f†jltartalom ki°r†sa

source: copy file
hu: f†jl m†sol†sa

source: rename file
hu: f†jl †tnevezÇse

source: existence of a file or directory
hu: f†jl vagy kînyvt†r meglÇtÇnek ellenãrzÇse

source: check device lock file
hu: eszkîz z†rol¢f†jl f†jl ellenãrzÇse

source: remove device lock file
hu: eszkîz z†rol¢f†jl f†jl tîrlÇse

source: show all constants array with their value or define a new one
hu: az îsszes †lland¢ tîmb ki°r†sa a mÇretÇvel vagy £j lÇtrehoz†sa

source: show all variable array with their value or define a new one
hu: az îsszes v†ltoz¢ tîmb ki°r†sa a mÇretÇvel vagy £j lÇtrehoz†sa

source: clear content of an array
hu: tîmb tartalm†nak tîrlÇse

source: fill an array with a character
hu: tîmb feltîltÇse adattal

source: get size of an array
hu: tîmbmÇret lekÇrdezÇse

source: set size of an array
hu: tîmbmÇret be†ll°t†sa

source: read/write data from/to remote device with DCON protocol
hu: adat olvas†sa/°r†sa t†voli eszkîzrãl/eszkîzre DCON protokollal

source: copyreg con? dinp|coil con? coil [$]ADDRESS [[$]COUNT] Notes: - The '?' value can be 0-7.
hu: copyreg con? dinp|coil con? coil [$]C÷M [[$]MENNYISêG] MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.

source: get dev?|pro?|con?|project|timeout Notes: - The '?' value can be 0-7. - The timeout value is in s.
hu: get dev?|pro?|con?|project|timeout MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet. - A 'timeout' ÇrtÇke mp-ben.

source: help [[$]COMMAND]
hu: help [[$]PARANCS]

source: let dinp|coil|ireg|hreg [$]ADDRESS [$]VALUE let $VARIABLE [$]VALUE let $VARIABLE nul let $VARIABLE dinp|coil|ireg|hreg [$]ADDRESS
hu: let dinp|coil|ireg|hreg [$]C÷M [$]êRTêK let $VµLTOZ‡ [$]êRTêK let $VµLTOZ‡ nul let $VµLTOZ‡ dinp|coil|ireg|hreg [$]C÷M

source: print dinp|coil|ireg|hreg [$]ADDRESS [[$]COUNT] [-n] print $VARIABLE [-n] print "single\ line\ message" [-n]
hu: print dinp|coil|ireg|hreg [$]C÷M [[$]MENNYISêG] [-n] print $VµLTOZ‡ [-n] print "single\ line\ message" [-n]

source: readreg con? dinp|coil|ireg|hreg [$]ADDRESS [[$]COUNT]
hu: readreg con? dinp|coil|ireg|hreg [$]C÷M [[$]MENNYISêG]

source: reset dev?|pro?|con?|project Notes: - The '?' value can be 0-7.
hu: reset dev?|pro?|con?|project MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.

source: set dev? net [$]DEVICE [$]PORT set dev? ser [$]DEVICE [$]BAUDRATE [$]DATABIT [$]PARITY [$]STOPBIT set pro? ascii|rtu [$]ID set pro? tcp [$]IP_ADDRESS set pro? dcon [$]ADDRESS set con? dev? pro? set color [$]FOREGROUND [$]BACKGROUND [$]RXD_TEXT [$]TXD_TEXT [$]VAR_MON set project [$]PROJECT_NAME set timeout [$]TIMEOUT Notes: - The '?' value can be 0-7. - The 'TIMEOUT' value can be 1-60 (s). - Colors: 0: black 4: red 8: darkgray 12: lightred 1: blue 5: magenta: 9: lightblue 13: lightmagenta 2: green 6: brown 10: lightgreen 14: yellow 3: cyan 7: lightgray 11: lightcyan 15: white
hu: set dev? net [$]ESZKôZ [$]PORT set dev? ser [$]ESZKôZ [$]BAUDRATE [$]ADATBIT [$]PARITµS [$]STOPBIT set pro? ascii|rtu [$]ID set pro? tcp [$]IP_C÷M set pro? dcon [$]C÷M set con? dev? pro? set color [$]ELäTêRSZ÷N [$]HµTTêRSZ÷N [$]VêTELSZ÷N [$]ADµSSZ÷N [$]VµLT_MON set project [$]PROJEKNêV set timeout [$]IDäTÈLLêPêS MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet. - A 'TIMEOUT' ÇrtÇke 1-60 (mp) lehet. - Sz°nek: 0: fekete 4: vîrîs 8: sîtÇtszÅrke 12: vil†gosvîrîs 1: kÇk 5: magenta: 9: vil†goskÇk 13: vil†gosmagenta 2: zîld 6: barna 10: vil†goszîld 14: s†rga 3: ci†n 7: vil†gosszÅrke 11: vil†gosci†n 15: fehÇr

source: date [$TARGET]
hu: date [$CêL]

source: writereg con? coil|hreg [$]ADDRESS [[$]COUNT] Notes: - The '?' value can be 0-7.
hu: writereg con? coil|hreg [$]C÷M [[$]MENNYISêG] MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.

source: savecfg [$]PATH_AND_FILENAME
hu: savecfg [$]ELêRêSI_ÈT_êS_FµJLNêV

source: loadcfg [$]PATH_AND_FILENAME
hu: loadcfg [$]ELêRêSI_ÈT_êS_FµJLNêV

source: expreg [$]PATH_AND_FILENAME dinp|coil|ireg|hreg [$]ADDRESS [[$]COUNT]
hu: expreg [$]ELêRêSI_ÈT_êS_FµJLNêV dinp|coil|ireg|hreg [$]C÷M [[$]MENNYISêG]

source: exphis [$]PATH_AND_FILENAME
hu: exphis [$]ELêRêSI_ÈT_êS_FµJLNêV

source: conv $TARGET bin|dec|hex|oct bin|dec|hex|oct [$]VALUE
hu: conv $CêL bin|dec|hex|oct bin|dec|hex|oct [$]êRTêK

source: savereg [$]PATH_AND_FILENAME
hu: savereg [$]ELêRêSI_ÈT_êS_FµJLNêV

source: loadreg [$]PATH_AND_FILENAME
hu: loadreg [$]ELêRêSI_ÈT_êS_FµJLNêV

source: var var NAME [[$]VALUE]
hu: var var NAME [[$]êRTêK]

source: printcolor [$]FOREGROUND [$]BACKGROUND Notes: - Colors: 0: black 4: red 8: darkgray 12: lightred 1: blue 5: magenta: 9: lightblue 13: lightmagenta 2: green 6: brown 10: lightgreen 14: yellow 3: cyan 7: lightgray 11: lightcyan 15: white
hu: printcolor [$]ELäTêRSZ÷N [$]HµTTêRSZ÷N MegjegyzÇs: - Sz°nek: 0: fekete 4: vîrîs 8: sîtÇtszÅrke 12: vil†gosvîrîs 1: kÇk 5: magenta: 9: vil†goskÇk 13: vil†gosmagenta 2: zîld 6: barna 10: vil†goszîld 14: s†rga 3: ci†n 7: vil†gosszÅrke 11: vil†gosci†n 15: fehÇr

source: impreg [$]PATH_AND_FILENAME
hu: impreg [$]ELêRêSI_ÈT_êS_FµJLNêV

source: and $TARGET [$]VALUE1 [$]VALUE2
hu: and $CêL [$]êRTêK1 [$]êRTêK2

source: or $TARGET [$]VALUE1 [$]VALUE2
hu: or $CêL [$]êRTêK1 [$]êRTêK2

source: not $TARGET [$]VALUE
hu: not $CêL [$]êRTêK

source: xor $TARGET [$]VALUE1 [$]VALUE2
hu: xor $CêL [$]êRTêK1 [$]êRTêK2

source: shl $TARGET [$]VALUE1 [$]VALUE2
hu: shl $CêL [$]êRTêK1 [$]êRTêK2

source: shr $TARGET [$]VALUE1 [$]VALUE2
hu: shr $CêL [$]êRTêK1 [$]êRTêK2

source: add $TARGET [$]VALUE1 [$]VALUE2
hu: add $CêL [$]êRTêK1 [$]êRTêK2

source: sub $TARGET [$]VALUE1 [$]VALUE2
hu: sub $CêL [$]êRTêK1 [$]êRTêK2

source: mul $TARGET [$]VALUE1 [$]VALUE2
hu: mul $CêL [$]êRTêK1 [$]êRTêK2

source: div $TARGET [$]VALUE1 [$]VALUE2
hu: div $CêL [$]êRTêK1 [$]êRTêK2

source: dump [[dinp|coil|ireg|hreg] [$]ADDRESS]
hu: dump [[dinp|coil|ireg|hreg] [$]C÷M]

source: pause [[$]TIME]
hu: pause [[$]IDä]

source: sercons [dev?] Notes: - The '?' value can be 0-7.
hu: sercons [dev?] MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.

source: serread dev? [$TARGET] Notes: - The '?' value can be 0-7.
hu: serread dev? [$CêL] MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.

source: serwrite dev? $MESSAGE serwrite dev? "MESSAGE" Notes: - The '?' value can be 0-7.
hu: serwrite dev? $öZENET serwrite dev? "öZENET" MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.

source: loadscr [$]PATH_AND_FILENAME
hu: loadscr [$]ELêRêSI_ÈT_êS_FµJLNêV

source: round $TARGET [$]VALUE [$]DEC_PLACES
hu: round $CêL [$]êRTêK [$]DEC_HELYEK

source: cos $TARGET [$]VALUE
hu: cos $CêL [$]êRTêK

source: cotan $TARGET [$]VALUE
hu: cotan $CêL [$]êRTêK

source: dec $VARIABLE
hu: dec $VµLTOZ‡

source: exp $TARGET [$]VALUE
hu: exp $CêL [$]êRTêK

source: idiv $TARGET [$]VALUE1 [$]VALUE2
hu: idiv $CêL [$]êRTêK1 [$]êRTêK2

source: imod $TARGET [$]VALUE1 [$]VALUE2
hu: imod $CêL [$]êRTêK1 [$]êRTêK2
