Repository: pozsarzs/modshell
Catalog: message/*-cp852/modshell.po
Languages: hu

source: inc $VARIABLE
hu: inc $VµLTOZ‡

source: ln $TARGET [$]VALUE
hu: ln $CêL [$]êRTêK

source: mulinv $TARGET [$]VALUE
hu: mulinv $CêL [$]êRTêK

source: odd $TARGET [$]VALUE
hu: odd $CêL [$]êRTêK

source: rnd $TARGET [$]VALUE
hu: rnd $CêL [$]êRTêK

source: tan $TARGET [$]VALUE
hu: tan $CêL [$]êRTêK

source: sin $TARGET [$]VALUE
hu: sin $CêL [$]êRTêK

source: sqr $TARGET [$]VALUE
hu: sqr $CêL [$]êRTêK

source: sqrt $TARGET [$]VALUE
hu: sqrt $CêL [$]êRTêK

source: roll $TARGET [$]VALUE1 [$]VALUE2
hu: roll $CêL [$]êRTêK1 [$]êRTêK2

source: rolr $TARGET [$]VALUE1 [$]VALUE2
hu: rolr $CêL [$]êRTêK1 [$]êRTêK2

source: upcase $TARGET [$]VALUE
hu: upcase $CêL [$]êRTêK

source: length $TARGET [$]VALUE
hu: length $CêL [$]êRTêK

source: lowcase $TARGET [$]VALUE
hu: lowcase $CêL [$]êRTêK

source: stritem $TARGET [$]VALUE1 [$]VALUE2
hu: stritem $CêL [$]êRTêK1 [$]êRTêK2

source: chr $TARGET [$]VALUE
hu: chr $CêL [$]êRTêK

source: ord $TARGET [$]VALUE
hu: ord $CêL [$]êRTêK

source: const const NAME [[$]VALUE]
hu: const const NAME [[$]êRTêK]

source: bit $TARGET [$]VALUE1 [$]VALUE2
hu: bit $CêL [$]êRTêK1 [$]êRTêK2

source: pow $TARGET [$]BASE [$]EXPONENT
hu: pow $CêL [$]ALAP [$]KITEVä

source: goto LABEL
hu: goto C÷MKE

source: if [$]VALUE1 RELATIONAL_SIGN [$]VALUE2 then COMMAND
hu: if [$]êRTêK1 RELµCI‡JEL [$]êRTêK2 then PARANCS

source: for $VARIABLE [$]VALUE1 to [$]VALUE2 do COMMAND
hu: for $VµLTOZ‡ [$]êRTêK to [$]êRTêK do PARANCS

source: label NAME
hu: label NêV

source: mbsrv con? Notes: - The '?' value can be 0-7.
hu: mbsrv con? MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.

source: mbgw con? con? Notes: - The '?' value can be 0-7.
hu: mbgw con? con? MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.

source: inrange $TARGET [$]MIN [$]MAX [$]VALUE
hu: inrange $CêL [$]MIN [$]MAX [$]êRTêK

source: mklrc $TARGET [$]STRING
hu: mklrc $CêL [$]KARAKTERLµNC

source: mkcrc $TARGET [$]STRING
hu: mkcrc $CêL [$]KARAKTERLµNC

source: pow2 $TARGET [$]EXPONENT
hu: pow2 $CêL [$]KITEVä

source: avg $TARGET [$]VALUE1 [$]VALUE2 [[$]VALUE3...6]
hu: avg $CêL [$]êRTêK1 [$]êRTêK2 [[$]êRTêK3...6]

source: prop $TARGET [$]MIN [$]MAX [$]ZERO [$]SPAN [$]VALUE
hu: prop $CêL [$]MIN [$]MAX [$]KEZDET [$]VêG [$]êRTêK

source: concat $TARGET [$]VALUE1 [$]VALUE2
hu: concat $CêL [$]êRTêK1 [$]êRTêK2

source: strdel $TARGET [$]PLACE [$]COUNT
hu: strdel $CêL [$]HELY [$]MENNYISêG

source: strfind $TARGET [$]VALUE
hu: strfind $CêL [$]êRTêK

source: strins $TARGET [$]PLACE [$]VALUE
hu: strins $CêL [$]HELY [$]êRTêK

source: strrepl $TARGET [$]OLD [$]NEW
hu: strrepl $CêL [$]RêGI [$]ÈJ

source: varmon on|off varmon $VARIABLE on|off
hu: varmon on|off varmon $VµLTOZ‡ on|off

source: applog [$]LOGFILE $TEXT [$]LEVEL [[$]VALUE1] ... [[$]VALUE4] applog [$]LOGFILE "TEXT\ $$1\ TEXT" [$]LEVEL [$]VALUE1 Notes: - The '$$1' value can be $$1-$$4. - The 'LEVEL' value can be 0-4: NOTE, MESSAGE, WARNING, ERROR, DEBUG.
hu: applog [$]LOGFILE $TEXT [$]LEVEL [[$]VALUE1] ... [[$]VALUE4] applog [$]LOGFILE "TEXT\ $$1\ TEXT" [$]LEVEL [$]VALUE1 MegjegyzÇs: - A '$$1' ÇrtÇke $$1-$$4 lehet. - A 'LEVEL' ÇrtÇke 0-4 lehet: NOTE, MESSAGE, WARNING, ERROR, DEBUG.

source: cron cron rec_num hour minute cron [-r rec_num]
hu: cron cron bejegyzÇs ¢ra perc cron [-r bejegyzÇs]

source: edit [LINE_NUMBER]
hu: edit [SORSZµM]

source: savescr [$]PATH_AND_FILENAME
hu: savescr [$]ELêRêSI_ÈT_êS_FµJLNêV

source: dir [[$]PATH_AND_DIRECTORYNAME]
hu: dir [[$]ELêRêSI_ÈT_êS_FµJLNêV]

source: cd [[$]PATH_AND_DIRECTORYNAME]
hu: cd [[$]ELêRêSI_ÈT_êS_FµJLNêV]

source: md [$]PATH_AND_DIRECTORYNAME
hu: md [$]ELêRêSI_ÈT_êS_FµJLNêV

source: rd [$]PATH_AND_DIRECTORYNAME
hu: rd [$]ELêRêSI_ÈT_êS_FµJLNêV

source: del [$]PATH_AND_FILENAME
hu: del [$]ELêRêSI_ÈT_êS_FµJLNêV

source: type [$]PATH_AND_FILENAME
hu: type [$]ELêRêSI_ÈT_êS_FµJLNêV

source: copy [$]PATH_AND_FILENAME [$]NEW_PATH_AND_FILENAME
hu: copy [$]ELêRêSI_ÈT_êS_FµJLNêV [$]ELêRêSI_ÈT_êS_FµJLNêV

source: ren [$]PATH_AND_FILENAME [$]NEW_PATH_AND_FILENAME
hu: ren [$]ELêRêSI_ÈT_êS_FµJLNêV [$]ELêRêSI_ÈT_êS_FµJLNêV

source: exist [$]PATH_AND_FILENAME
hu: exist [$]ELêRêSI_ÈT_êS_FµJLNêV

source: chkdevlock [$]DEVICE
hu: chkdevlock [$]ESZKôZ

source: rmdevlock [$]DEVICE
hu: rmdevlock [$]ESZKôZ

source: carr carr ARRAY carr ARRAY SIZE
hu: carr carr TôMB carr TôMB MêRET

source: varr varr ARRAY varr ARRAY SIZE
hu: varr varr TôMB varr TôMB MêRET

source: arrclear ARRAY
hu: arrclear TôMB

source: arrfill ARRAY [$]DATA
hu: arrfill TôMB [$]ADAT

source: getarrsize ARRAY $TARGET
hu: getarrsize TôMB $CêL

source: setarrsize ARRAY [$]SIZE
hu: setarrsize TôMB [$]MêRET

source: dcon con? $TXARRAY $RXARRAY Notes: - The '?' value can be 0-7.
hu: dcon con? $TXTôMB $RXTôMB MegjegyzÇs: - A '?' ÇrtÇke 0-7 lehet.
