Repository: pozsarzs/modshell
Catalog: message/*-cp1250/modshell.po
Languages: hu

source: 1st
hu: Elsõ

source: 2nd
hu: Második

source: 3rd
hu: Harmadik

source: 4th
hu: Negyedik

source: 5th
hu: Ötödik

source: 6th
hu: Hatodik

source: 7th
hu: Hetedik

source: Command-driven scriptable Modbus utility
hu: Parancsvezérelt szkriptelhetõ Modbus segédprogram

source: Use 'help COMMAND' to show usage.
hu: Használja a 'help PARANCS'-ot a használata megjelenítéséhez.

source: Usage this command:
hu: A parancs használata:

source: parameter:
hu: paraméter:

source: is not set.
hu: nincs beállítva.

source: device:
hu: eszköz:

source: baudrate:
hu: sebesség:

source: bits:
hu: bitek:

source: protocol:
hu: protokoll:

source: IP address:
hu: IP-cím:

source: device UID:
hu: eszköz UID:

source: File exist, overwrite? (y/n)
hu: Létezik a fájl, felülírjam? (y/n)

source: Command line history has exported to
hu: A parancssori elõzmények exportáltak ebbe:

source: Settings has saved to
hu: A beállítások el lettek mentve ebbe:

source: Settings has loaded from
hu: A beállítások be lettek töltve ebbõl:

source: Register content has exported to
hu: A regisztertartalom exportálva ebbe:

source: Register content has imported from
hu: A regisztertartalom importált ebbõl:

source: Register content has saved to
hu: A regisztertartalom elmentve ebbe:

source: Register content has loaded from
hu: A regisztertartalom betöltve ebbõl:

source: Useable file types:
hu: Használható fájltípusok:

source: Press a key to continue...
hu: Nyomjon meg egy billentyût a folytatáshoz...

source: Note: - register: local buffer register - remote register: register of the connected device
hu: Megjegyzés: - regiszter: helyi puffer regiszter - távoli regiszter: a csatlakoztatott eszköz regisztere

source: Select register type:
hu: Válasszon regisztertípust:

source: Local register type (dinp/coil/ireg/hreg: 1/2/3/4):
hu: Helyi regiszter típus (dinp/coil/ireg/hreg: 1/2/3/4):

source: Start address (0-9990):
hu: Kezdõcím (0-9990):

source: Echo mode:
hu: Visszhang mód:

source: Mini serial console (exit: <F10>)
hu: Mini soros konzol (kilépés: <F10>)

source: Device number (0-7):
hu: Eszközszám (0-7):

source: Press <Esc> to break receiving.
hu: Nyomd meg az <Esc>-et a vétel megszakításához.

source: Variable monitor mode:
hu: Változó monitor mód:

source: This command can only be used in a script!
hu: Ez a parancs csak szkriptben használható!

source: line
hu: sor

source: hour
hu: óra

source: minute
hu: perc

source: status
hu: állapot

source: No script loaded.
hu: Nincs betöltött szkript.

source: Scroll: [Home][PgUp][Up]-[Down][PgDn][End]
hu: Görgetés: [Home][PgUp][Up]-[Down][PgDn][End]

source: Move: [Ctrl-Home][Ctrl-Left][Left]-[Right][Ctrl-Right][Ctrl-End]
hu: Mozgás: [Ctrl-Home][Ctrl-Left][Left]-[Right][Ctrl-Right][Ctrl-End]

source: Edit: [Ins][Del][Esc]
hu: Szerkesztés: [Ins][Del][Esc]

source: all file|*
hu: minden fájl|*

source: batch file|*.bat|all file|*.*
hu: batch fájl|*.bat|minden fájl|*.*

source: &Cancel
hu: &Mégsem

source: &Set
hu: &Beállít

source: &Reset
hu: &Töröl

source: foreground
hu: elõtérszín

source: background
hu: háttérszín

source: type
hu: típus

source: device
hu: eszköz

source: port/baudrate
hu: port/sebesség

source: databits
hu: adatbitek

source: parity
hu: paritás

source: stopbit(s)
hu: stopbit(ek)

source: protocol
hu: protokoll

source: UID/IP address
hu: UID/IP cím

source: CSV file|*.csv|INI file|*.ini|XML file|*.xml
hu: CSV fájl|*.csv|INI fájl|*.ini|XML fájl|*.xml

source: INI file|*.ini|XML file|*.xml
hu: INI fájl|*.ini|XML fájl|*.xml

source: registers
hu: regiszterek

source: start address
hu: kezdõcím

source: count
hu: mennyiség

source: &Export
hu: &Exportál

source: &Dump
hu: &Kiírat

source: Use 'Project/Set console colors' on GUI version.
hu: Használja a Projekt/Konzol színek beállítása'-t a GUI változatnál.

source: Use 'Script/Edit script' on GUI version.
hu: Használja a Szkript/Szkript szerkesztés'-t a GUI változatnál.

source: from
hu: ebbõl

source: to
hu: ebbe

source: number
hu: szám

source: &Convert
hu: Át&alakít

source: &Start
hu: In&dítás

source: New project name:
hu: Új projekt név:

source: name
hu: név

source: connection
hu: kapcsolat

source: variable
hu: változó

source: message
hu: üzenet

source: &Write
hu: Í&rás

source: &Read
hu: Ol&vasás

source: Go on!
hu: Indítás

source: Variable
hu: Változó

source: Value
hu: Érték

source: Use 'Utilities/Mini serial console' on GUI version.
hu: Használja az 'Eszközök/Mini soros konzol'-t a GUI változatnál.

source: timeout
hu: idõtúllépés

source: or a variable
hu: vagy változó

source: Build date:
hu: Fordítás ideje:

source: Builder:
hu: Fordító:

source: FPC version:
hu: FPC verzió:

source: Target OS:
hu: Cél OS:

source: Target CPU:
hu: Cél CPU:

source: Sorry, this feature is not yet implemented.
hu: Sajnálom, hogy ez a szolgáltatás még nem valósult meg.

source: No such command!
hu: Nincs ilyen parancs!

source: Device number must be 0-7!
hu: Az eszköz számának 0-7-nek kell lennie!

source: Protocol number must be 0-7!
hu: A protokoll számának 0-7-nek kell lennie!

source: Connection number must be 0-7!
hu: A kapcsolat számának 0-7-nek kell lennie!

source: IP address is not valid!
hu: Az IP-cím nem érvényes!

source: Parameter(s) required!
hu: Paraméterek szükséges(ek)!

source: UID must be 1-247!
hu: Az UID-nek 1-247-nek kell lennie!

source: Cannot export command line history to
hu: Nem lehet exportálni a parancssori elõzményeket ebbe:

source: Cannot save settings to
hu: Nem lehet menteni a beállításokat ebbe:

source: Cannot load settings from
hu: Nem lehet betölteni a beállításokat ebbõl:

source: Cannot export register content to
hu: Nem lehet exportálni a regisztertartalmat ebbe:

source: Cannot import register content from
hu: Nem lehet importálni a regisztertartalmat ebbõl:

source: Cannot save register content to
hu: Nem mentheti a regisztertartalmat ebbe:

source: Cannot load register content from
hu: Nem lehet betölteni a regisztertartalmat ebbõl:

source: Illegal character in the project name!
hu: Nem engedélyezett karakter a projekt nevében!

source: Illegal character in the variable name!
hu: Nem engedélyezett karakter a változó nevében!

source: Cannot define more variable!
hu: Nem lehet létrehozni a változót!

source: There is already a variable or a constant with that name.
hu: Van már egy változó vagy állandó ezzel a névvel.

source: Cannot initialize serial port:
hu: Nem lehet inicializálni a soros portot!

source: No such variable:
hu: Nincs ilyen változó:

source: Calculating error!
hu: Számítási hiba!

source: No such script file:
hu: Nincs ilyen szkriptfájl:

source: Cannot load script from
hu: Nem lehet betölteni a szkriptet ebbõl:

source: Script buffer is full!
hu: A szkript puffer megtelt!

source: Specified device is not a serial port!
hu: A megadott eszköz nem soros port!

source: Specified device is not a ethernet port!
hu: A megadott eszköz nem ethernet port!

source: Cannot read data from serial port!
hu: Nem lehet olvasni a soros portról!

source: Cannot write data to serial port!
hu: Nem lehet írni a soros portot!

source: Modbus telegram parsing error!
hu: Modbus telegram értelmezési hiba!

source: Modbus error: illegal function.
hu: Modbus hiba: szabálytalan funkció.

source: Modbus error: illegal data address.
hu: Modbus hiba: szabálytalan adatcím.

source: Modbus error: illegal data value.
hu: Modbus hiba: szabálytalan adatérték.

source: Modbus error: slave device failure.
hu: Modbus hiba: slave eszköz hiba.

source: Illegal character in the constant name!
hu: Nem engedélyezett karakter az állandó nevében!

source: Cannot define more constant!
hu: Nem lehet létrehozni több állandót!

source: No such label:
hu: Nincs ilyen címke:

source: Cannot write log record to
hu: Nem lehet írni a naplófájlt:

source: Cannot save script to
hu: Nem lehet menteni a szkriptet ebbe:

source: Cannot run default webbrowser!
hu: Nem tudom futtatni az alapértelmezés szerinti böngészõt!

source: Cannot list directory!
hu: A könyvtártartalom listázása nem sikerült!

source: Cannot change directory!
hu: Nem sikerült könyvtárt váltani!

source: Cannot make directory!
hu: A könyvtár létrehozása nem sikerült!

source: Cannot remove directory!
hu: A könyvtár törlése nem sikerült!

source: Cannot erase file!
hu: A fájl törlése nem sikerült!

source: Cannot type file!
hu: A fájl kiírása nem sikerült!

source: Cannot copy file!
hu: A fájl másolása nem sikerült!

source: Cannot rename file!
hu: A fájl átnevezése nem sikerült!

source: Cannot set connection timeout!
hu: Nem lehet beállítani az idõtúllépést!

source: Operation error!
hu: Mûvelet hiba!

source: Locked device!
hu: Zárolt eszköz!

source: Cannot create console log file!
hu: Nem lehet létrehozni a konzol naplófájlját!

source: Minimal terminal size is 80x25!
hu: A legkisebb terminál méret 80x25!

source: copy one or more remote reg. between two connections
hu: egy vagy több távoli regiszter másolása két kapcsolat között

source: F10 exit from program
hu: F10 kilépés a programból

source: ALT-G show device, protocol, connection or project name
hu: ALT-G eszköz, protokoll, kapcsolat vagy projektnév kiírása

source: F1 show description or usage of the commands
hu: F1 parancs leírás vagy használat megjelenítése

source: ALT-L set value of a variable or a register
hu: ALT-L regisztertartalom beállítása

source: ALT-P print message, value of the variable and register
hu: ALT-P üzenet, a változó vagy regisztertartalom kiírása

source: ALT-R read one or more remote registers to buffer
hu: ALT-R adat olvasása távoli regiszterbõl a pufferbe

source: ALT-T reset device, protocol, connection or project name
hu: ALT-T eszköz, protokoll, kapcsolat vagy projektnév törlése

source: ALT-S set device, protocol, connection, project name or timeout
hu: ALT-S eszköz, protokoll, kapcsolat, projektnév vagy idõtúllépés beállítása

source: show system date and time
hu: dátum és idõ megjelenítése

source: show version and build information of this program
hu: változat és fordítási információk a programról

source: ALT-W write data from buffer to one or more remote registers
hu: ALT-W adat írása egy vagy több pufferbõl a távoli regiszterbe

source: F8 clear screen
hu: F8 képernyõtörlés

source: F2 save settings of device, protocol and connection
hu: F2 eszköz-, protokoll- és kapcsolatbeállítások mentése

source: F3 load settings of device, protocol and connection
hu: F3 eszköz-, protokoll- és kapcsolatbeállítások betöltése

source: ALT-E export value of the one or more registers
hu: ALT-E egy vagy több regisztertartalom exportálása

source: export command line history to make a script easily
hu: parancssori elõzmények exportálása

source: ALT-C convert value between different numeral systems
hu: ALT-C konvertálás a különbözõ számrendszerek között

source: F4 save all registers
hu: F4 összes regisztertartalom mentése

source: F5 load all registers
hu: F5 összes regisztertartalom betöltése

source: list all variable with value or define a new one
hu: az összes változó kiírása vagy új létrehozása

source: set colors
hu: színek beállítása

source: ALT-I import value of the one or more registers
hu: ALT-I egy vagy több regisztertartalom importálása

source: AND logical operations
hu: ÉS logikai mûvelet

source: OR logical operations
hu: VAGY logikai mûvelet

source: NOT logical operations
hu: NOT logikai mûvelet

source: XOR logical operations
hu: XOR logikai mûvelet

source: bit shift to left
hu: biteltolás balra

source: bit shift to right
hu: biteltolás jobbra

source: addition mathematical operation
hu: összeadás matematikai mûvelet

source: substraction mathematical operation
hu: kivonás matematikai mûvelet

source: multiplication mathematical operation
hu: szorzás matematikai mûvelet

source: division mathematical operation
hu: osztás matematikai mûvelet

source: F6 dump all registers in binary/hexadecimal format to a table
hu: F6 táblázatos regiszterkiírás bin. vagy hexadec. formában

source: wait for a keystroke or specified time
hu: várakozás billentyûleütésre vagy idõ leteltére

source: F7 open a simple serial console
hu: F7 egyszerû soros konzol

source: read string from serial device
hu: string olvasása soros portról

source: write string to serial device
hu: string írása soros portra

source: F9 query local echo status or enable/disable it
hu: F9 visszahang állapot lekérése/beállítása

source: load ModShell script from file
hu: ModShell szkript betöltése fájlból

source: F12 run loaded ModShell script
hu: F12 betöltött ModShell szkript futattása

source: F11 list loaded ModShell script
hu: F11 betöltött ModShell szkript listázása

source: round real number
hu: természetes szám kerekítése

source: cosine function
hu: koszinusz függvény

source: cotangent function
hu: kotangens függvény

source: decrement integer
hu: egész szám csökkentése eggyel

source: natural exponential
hu: természetes exponenciális függvény

source: integer division
hu: egész osztás

source: modulus division
hu: modulusz osztás

source: increment integer
hu: egész szám növelése eggyel

source: natural logarithm
hu: természetes alapú logaritmus

source: multiplicative inverse
hu: reciprokérték

source: odd or event
hu: páros vagy páratlan

source: create random integer
hu: véletlen egész szám képzése

source: tangent function
hu: tangens függvény

source: sine function
hu: szinusz függvény

source: square
hu: négyzetreemelés

source: square root
hu: négyzetgyökvonás

source: roll bit of integer to left
hu: bitgörgetés balra

source: roll bit of integer to right
hu: bitgörgetés jobbra

source: conversion to uppercase
hu: átalakítás nagybetûssé

source: length of string
hu: karakterlánc hossza

source: conversion to lowercase
hu: átalakítás kisbetûssé

source: specified element of the string
hu: a karakterlánc megadott eleme

source: convert byte to char
hu: bájt karakterré alakítása

source: convert char to byte
hu: karakter bájttá alakítása

source: list all constant with value or define a new one
hu: az összes állandó kiírása vagy új létrehozása

source: value of the specified bit
hu: megadott bit értéke

source: exponentiation
hu: hatványozás

source: jump to specified label (only in script)
hu: ugrás a megadott címkére (csak szkripteknél)

source: selection statement
hu: elágazás

source: loop iteration
hu: számláló hurok

source: define label (only in script)
hu: címke létrehozása (csak szkripteknél)

source: start internal Modbus slave/server
hu: start belsõ Modbus szolga/szerver

source: start internal Modbus gateway
hu: start belsõ Modbus átjáró

source: check the value is in the range
hu: értéktartományba tartozás ellenõrzése

source: make LRC
hu: LRC képzése

source: make CRC
hu: CRC képzése

source: exponentiation of two
hu: a kettõ hatványai

source: show ASCII table
hu: ASCII tábla mutatás

source: make a beep sound with internal speaker
hu: hangjelzés a belsõ hangszóróval

source: calculate average
hu: átlagszámítás

source: propotional value calculation (with zero and span)
hu: arányos érték számítás (kezdeti és végértékkel)

source: concatenate strings
hu: karakterláncok összefûzése

source: delete specified element(s) of the string
hu: a karakterlánc megadott elemének törlése

source: find specified element(s) in the string
hu: keresés a karakterláncban

source: insert element(s) into string
hu: beszúrás a karakterláncba

source: replace element(s) in the string
hu: a karakterlánc megadott elemének cseréje

source: ALT-M monitoring the value of variables
hu: ALT-M változóértékek megfigyelése

source: append a record to log file
hu: egy bejegyzés hozzáfûzése a naplófájlhoz

source: loaded script scheduled execution
hu: a betöltött szkript ütemezett futattása

source: edit loaded script with line editor
hu: a betöltött szkript szerkesztése sorszerkesztõvel

source: erase script from buffer
hu: a szkript törlése a pufferból

source: save loaded script to disc
hu: a betöltött szkript mentése lemezre

source: list directory content
hu: könyvtártartalom listázása

source: change directory or get name
hu: könyvtár váltása vagy könyvtárnév kiírása

source: make directory
hu: könyvtár létrehozása

source: remove directory
hu: könyvtár törlése

source: remove file
hu: fájl törlése

source: type file
hu: fájltartalom kiírása

source: copy file
hu: fájl másolása

source: rename file
hu: fájl átnevezése

source: copyreg con? dinp|coil con? coil [$]ADDRESS [[$]COUNT] Notes: - The '?' value can be 0-7.
hu: copyreg con? dinp|coil con? coil [$]CÍM [[$]MENNYISÉG] Megjegyzés: - A '?' értéke 0-7 lehet.

source: get dev?|pro?|con?|project|timeout Notes: - The '?' value can be 0-7. - The timeout value can be 1-60.
hu: get dev?|pro?|con?|project|timeout Megjegyzés: - A '?' értéke 0-7 lehet. - A 'timeout' értéke 1-60 lehet.

source: help [[$]COMMAND]
hu: help [[$]PARANCS]

source: let dinp|coil|ireg|hreg [$]ADDRESS [$]VALUE let $VARIABLE [$]VALUE let $VARIABLE dinp|coil|ireg|hreg [$]ADDRESS
hu: let dinp|coil|ireg|hreg [$]CÍM [$]ÉRTÉK let $VÁLTOZÓ [$]ÉRTÉK let $VÁLTOZÓ dinp|coil|ireg|hreg [$]CÍM

source: print dinp|coil|ireg|hreg [$]ADDRESS [[$]COUNT] [-n] print $VARIABLE [-n] print "single\ line\ message" [-n]
hu: print dinp|coil|ireg|hreg [$]CÍM [[$]MENNYISÉG] [-n] print $VÁLTOZÓ [-n] print "single\ line\ message" [-n]

source: readreg con? dinp|coil|ireg|hreg [$]ADDRESS [[$]COUNT]
hu: readreg con? dinp|coil|ireg|hreg [$]CÍM [[$]MENNYISÉG]

source: reset dev?|pro?|con?|project Notes: - The '?' value can be 0-7.
hu: reset dev?|pro?|con?|project Megjegyzés: - A '?' értéke 0-7 lehet.

source: set dev? net [$]DEVICE [$]PORT set dev? ser [$]DEVICE [$]BAUDRATE [$]DATABIT [$]PARITY [$]STOPBIT set pro? ascii|rtu [$]UID set pro? tcp [$]IP_ADDRESS set con? dev? pro? set project [$]PROJECT_NAME set timeout [$]TIME_OUT Notes: - The '?' value can be 0-7. - The 'TIMEOUT' value is in ms.
hu: set dev? net [$]ESZKÖZ [$]PORT set dev? ser [$]ESZKÖZ [$]BAUDRATE [$]ADATBIT [$]PARITÁS [$]STOPBIT set pro? ascii|rtu [$]UID set pro? tcp [$]IP_CÍM set con? dev? pro? set project [$]PROJEKNÉV set timeout [$]IDÕTÚLLÉPÉS Megjegyzés: - A '?' értéke 0-7 lehet. - A 'TIMEOUT' értéke ms-ban van.

source: writereg con? coil|hreg [$]ADDRESS [[$]COUNT] Notes: - The '?' value can be 0-7.
hu: writereg con? coil|hreg [$]CÍM [[$]MENNYISÉG] Megjegyzés: - A '?' értéke 0-7 lehet.

source: savecfg [$]PATH_AND_FILENAME
hu: savecfg [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: loadcfg [$]PATH_AND_FILENAME
hu: loadcfg [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: expreg [$]PATH_AND_FILENAME dinp|coil|ireg|hreg [$]ADDRESS [[$]COUNT]
hu: expreg [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV dinp|coil|ireg|hreg [$]CÍM [[$]MENNYISÉG]

source: exphis [$]PATH_AND_FILENAME
hu: exphis [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: conv bin|dec|hex|oct bin|dec|hex|oct [$]VALUE
hu: conv bin|dec|hex|oct bin|dec|hex|oct [$]ÉRTÉK

source: savereg [$]PATH_AND_FILENAME
hu: savereg [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: loadreg [$]PATH_AND_FILENAME
hu: loadreg [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: var var NAME [[$]VALUE]
hu: var var NAME [[$]ÉRTÉK]

source: color [$]FOREGROUND [$]BACKGROUND [$]RXD_TEXT [$]TXD_TEXT [$]VARMON colors: 0: black 4: red 8: darkgray 12: lightred 1: blue 5: magenta: 9: lightblue 13: lightmagenta 2: green 6: brown 10: lightgreen 14: yellow 3: cyan 7: lightgray 11: lightcyan 15: white
hu: color [$]ELÕTÉRSZÍN [$]HÁTTÉRSZÍN [$]VÉTELSZÍN [$]ADÁSSZÍN [$]VÁLTMON színek: 0: fekete 4: vörös 8: sötétszürke 12: világosvörös 1: kék 5: magenta: 9: világoskék 13: világosmagenta 2: zöld 6: barna 10: világoszöld 14: sárga 3: cián 7: világosszürke 11: világoscián 15: fehér

source: impreg [$]PATH_AND_FILENAME
hu: impreg [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: and $TARGET [$]VALUE1 [$]VALUE2
hu: and $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: or $TARGET [$]VALUE1 [$]VALUE2
hu: or $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: not $TARGET [$]VALUE
hu: not $CÉL [$]ÉRTÉK

source: xor $TARGET [$]VALUE1 [$]VALUE2
hu: xor $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: shl $TARGET [$]VALUE1 [$]VALUE2
hu: shl $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: shr $TARGET [$]VALUE1 [$]VALUE2
hu: shr $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: add $TARGET [$]VALUE1 [$]VALUE2
hu: add $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: sub $TARGET [$]VALUE1 [$]VALUE2
hu: sub $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: mul $TARGET [$]VALUE1 [$]VALUE2
hu: mul $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: div $TARGET [$]VALUE1 [$]VALUE2
hu: div $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: dump [[dinp|coil|ireg|hreg] [$]ADDRESS]
hu: dump [[dinp|coil|ireg|hreg] [$]CÍM]

source: pause [[$]TIME]
hu: pause [[$]IDÕ]

source: sercons [dev?] Notes: - The '?' value can be 0-7.
hu: sercons [dev?] Megjegyzés: - A '?' értéke 0-7 lehet.

source: serread dev? [$TARGET] Notes: - The '?' value can be 0-7.
hu: serread dev? [$CÉL] Megjegyzés: - A '?' értéke 0-7 lehet.

source: serwrite dev? $MESSAGE serwrite dev? "MESSAGE" Notes: - The '?' value can be 0-7.
hu: serwrite dev? $ÜZENET serwrite dev? "ÜZENET" Megjegyzés: - A '?' értéke 0-7 lehet.

source: loadscr [$]PATH_AND_FILENAME
hu: loadscr [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: round $TARGET [$]VALUE [$]DEC_PLACES
hu: round $CÉL [$]ÉRTÉK [$]DEC_HELYEK

source: cos $TARGET [$]VALUE
hu: cos $CÉL [$]ÉRTÉK

source: cotan $TARGET [$]VALUE
hu: cotan $CÉL [$]ÉRTÉK

source: dec $VARIABLE
hu: dec $VÁLTOZÓ

source: exp $TARGET [$]VALUE
hu: exp $CÉL [$]ÉRTÉK

source: idiv $TARGET [$]VALUE1 [$]VALUE2
hu: idiv $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: imod $TARGET [$]VALUE1 [$]VALUE2
hu: imod $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: inc $VARIABLE
hu: inc $VÁLTOZÓ

source: ln $TARGET [$]VALUE
hu: ln $CÉL [$]ÉRTÉK

source: mulinv $TARGET [$]VALUE
hu: mulinv $CÉL [$]ÉRTÉK

source: odd $TARGET [$]VALUE
hu: odd $CÉL [$]ÉRTÉK

source: rnd $TARGET [$]VALUE
hu: rnd $CÉL [$]ÉRTÉK

source: tan $TARGET [$]VALUE
hu: tan $CÉL [$]ÉRTÉK

source: sin $TARGET [$]VALUE
hu: sin $CÉL [$]ÉRTÉK

source: sqr $TARGET [$]VALUE
hu: sqr $CÉL [$]ÉRTÉK

source: sqrt $TARGET [$]VALUE
hu: sqrt $CÉL [$]ÉRTÉK

source: roll $TARGET [$]VALUE1 [$]VALUE2
hu: roll $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: rolr $TARGET [$]VALUE1 [$]VALUE2
hu: rolr $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: upcase $TARGET [$]VALUE
hu: upcase $CÉL [$]ÉRTÉK

source: length $TARGET [$]VALUE
hu: length $CÉL [$]ÉRTÉK

source: lowcase $TARGET [$]VALUE
hu: lowcase $CÉL [$]ÉRTÉK

source: stritem $TARGET [$]VALUE1 [$]VALUE2
hu: stritem $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: chr $TARGET [$]VALUE
hu: chr $CÉL [$]ÉRTÉK

source: ord $TARGET [$]VALUE
hu: ord $CÉL [$]ÉRTÉK

source: const const NAME [$]VALUE
hu: const const NAME [[$]ÉRTÉK]

source: bit $TARGET [$]VALUE1 [$]VALUE2
hu: bit $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: pow $TARGET [$]BASE [$]EXPONENT
hu: pow $CÉL [$]ALAP [$]KITEVÕ

source: goto LABEL
hu: goto CÍMKE

source: if [$]VALUE1 RELATIONAL_SIGN [$]VALUE2 then COMMAND
hu: if [$]ÉRTÉK1 RELÁCIÓJEL [$]ÉRTÉK2 then PARANCS

source: for $VARIABLE [$]VALUE1 to [$]VALUE2 do COMMAND
hu: for $VÁLTOZÓ [$]ÉRTÉK to [$]ÉRTÉK do PARANCS

source: label NAME
hu: label NÉV

source: mbsrv con? Notes: - The '?' value can be 0-7.
hu: mbsrv con? Megjegyzés: - A '?' értéke 0-7 lehet.

source: mbgw con? con? Notes: - The '?' value can be 0-7.
hu: mbgw con? con? Megjegyzés: - A '?' értéke 0-7 lehet.

source: inrange $TARGET [$]MIN [$]MAX [$]VALUE
hu: inrange $CÉL [$]MIN [$]MAX [$]ÉRTÉK

source: mklrc $TARGET [$]STRING
hu: mklrc $CÉL [$]KARAKTERLÁNC

source: mkcrc $TARGET [$]STRING
hu: mkcrc $CÉL [$]KARAKTERLÁNC

source: pow2 $TARGET [$]EXPONENT
hu: pow2 $CÉL [$]KITEVÕ

source: avg $TARGET [$]VALUE1 [$]VALUE2 [[$]VALUE3...6]
hu: avg $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2 [[$]ÉRTÉK3...6]

source: prop $TARGET [$]MIN [$]MAX [$]ZERO [$]SPAN [$]VALUE
hu: prop $CÉL [$]MIN [$]MAX [$]KEZDET [$]VÉG [$]ÉRTÉK

source: concat $TARGET [$]VALUE1 [$]VALUE2
hu: concat $CÉL [$]ÉRTÉK1 [$]ÉRTÉK2

source: strdel $TARGET [$]PLACE [$]COUNT
hu: strdel $CÉL [$]HELY [$]MENNYISÉG

source: strfind $TARGET [$]VALUE
hu: strfind $CÉL [$]ÉRTÉK

source: strins $TARGET [$]PLACE [$]VALUE
hu: strins $CÉL [$]HELY [$]ÉRTÉK
