Repository: pozsarzs/modshell
Catalog: message/*-cp1250/modshell.po
Languages: hu

source: strrepl $TARGET [$]OLD [$]NEW
hu: strrepl $CÉL [$]RÉGI [$]ÚJ

source: varmon on|off varmon $VARIABLE on|off
hu: varmon on|off varmon $VÁLTOZÓ on|off

source: applog [$]LOGFILE $TEXT [$]LEVEL [[$]VALUE1] ... [[$]VALUE4] applog [$]LOGFILE "TEXT\ $$1\ TEXT" [$]LEVEL [$]VALUE1 Notes: - The '$$1' value can be $$1-$$4. - The 'LEVEL' value can be 0-4: NOTE, MESSAGE, WARNING, ERROR, DEBUG.
hu: applog [$]LOGFILE $TEXT [$]LEVEL [[$]VALUE1] ... [[$]VALUE4] applog [$]LOGFILE "TEXT\ $$1\ TEXT" [$]LEVEL [$]VALUE1 Megjegyzés: - A '$$1' értéke $$1-$$4 lehet. - A 'LEVEL' értéke 0-4 lehet: NOTE, MESSAGE, WARNING, ERROR, DEBUG.

source: cron cron rec_num hour minute cron [-r rec_num]
hu: cron cron bejegyzés óra perc cron [-r bejegyzés]

source: edit [LINE_NUMBER]
hu: edit [SORSZÁM]

source: savescr [$]PATH_AND_FILENAME
hu: savescr [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: dir [[$]PATH_AND_DIRECTORYNAME]
hu: dir [[$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV]

source: cd [[$]PATH_AND_DIRECTORYNAME]
hu: cd [[$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV]

source: md [$]PATH_AND_DIRECTORYNAME
hu: md [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: rd [$]PATH_AND_DIRECTORYNAME
hu: rd [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: del [$]PATH_AND_FILENAME
hu: del [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: type [$]PATH_AND_FILENAME
hu: type [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: copy [$]PATH_AND_FILENAME [$]NEW_PATH_AND_FILENAME
hu: copy [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV

source: ren [$]PATH_AND_FILENAME [$]NEW_PATH_AND_FILENAME
hu: ren [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV [$]ELÉRÉSI_ÚT_ÉS_FÁJLNÉV
